[{
	"title": "Assignment-1",
	"activityType": "assignment",
	"quizDescription":"Consider two tables R(A,B) and S(C). Below are pairs of transactions. For each pair, decide whether it is possible for nonserializable behavior to be exhibited(give explanation) when executing the transactions concurrently, while respecting their specified isolation levels. Assume individual statements are executed atomically, and each transaction executes to completion.",
	"questions": [{
			"questionType": "filesubmission",
			"questionText": " <code>Transaction 1:<br>    Set Transaction Isolation Level Read Committed;<br>   Select count(*) From R;<br>    Select count(*) From S;<br>   Commit;<br>    Transaction 2:<br>    Set Transaction Isolation Level Serializable;<br>    Insert Into R Values (1,2);<br>    Insert Into S Values (3);<br>    Commit;<br> </code> ",
			"points":"3"

		},

		{
			"questionType": "filesubmission",
			"questionText": " <code> Transaction 1: <br>    Set Transaction Isolation Level Read Committed;<br>   Select count(*) From R;<br>    Select count(*) From S;<br>    Commit;<br>    Transaction 2:<br>    Set Transaction Isolation Level Serializable;<br>    Insert Into R Values (1,2);<br>    Insert Into R Values (3,4);<br>    Commit; </code>",
			"points":"3"

		},

		{
			"questionType": "filesubmission",
			"questionText": " <code> Transaction 1: <br>    Set Transaction Isolation Level Repeatable Read;<br>    Select count(*) From R;<br>    Select count(*) From S;<br>    Select count(*) From R;<br>    Commit;<br>    Transaction 2:<br>    Set Transaction Isolation Level Serializable;<br>    Insert Into R Values (1,2);<br>    Commit; </code>",
			"points":"3"

		}

	]
},
{
	"title": "Assignment-2",
	"activityType": "assignment",
	"quizDescription":"Consider table Item(name,price) where name is a key, and the following two concurrent transactions. <br> <code>T1: <br>  Begin Transaction; <br> S1: Insert Into Item Values ('scissors',40); <br> S2: Update Item Set price = price + 30 Where name = 'pencil'; <br> Commit;<br>T2: <br> Begin Transaction; <br> S3: Select Avg(price) As a1 From Item; <br> S4: Select Avg(price) As a2 From Item; <br> Commit;<br>Assume that the individual statements S1, S2, S3, and S4 always execute atomically. Suppose initially there are two tuples in Item: (pencil,20) and (pen,30). Each transaction runs once and commits. Transaction T1 always executes with isolation level Serializable. </code>",

	"questions": [{
			"questionType": "filesubmission",
			"questionText": " If transaction T2 executes with isolation level Serializable, what possible pairs of values a1 and a2 are returned by T2? ",
			"points":"1"

		},

		{
			"questionType": "filesubmission",
			"questionText": " If transaction T2 executes with isolation level Repeatable-Read, what possible pairs of values a1 and a2 are returned by T2?",
			"points":"1"

		},

		{
			"questionType": "filesubmission",
			"questionText": "  If transaction T2 executes with isolation level Read-Committed, what possible pairs of values a1 and a2 are returned by T2? ",
			"points":"1"

		},

		{
			"questionType": "filesubmission",
			"questionText": "  If transaction T2 executes with isolation level Read-Uncommitted, what possible pairs of values a1 and a2 are returned by T2? ",
			"points":"1"
			
		}

	]
},
{
	"title": "Assignment-3",
	"activityType": "assignment",
	"quizDescription":"Consider table Person(name,age) and the following transaction<br><code> T: Begin Transaction;<br> Q1: Select Avg(age) From Person;<br>  <read-only activity><br>  Q2: Select Avg(age) From Person;<br>  Commit;</code><br>Assume queries Q1 and Q2 always execute atomically. ",
	"questions": [{
			"questionType": "filesubmission",
			"questionText": " Suppose all other transactions in the system are declared as Serializable and Read-Only. What is the weakest isolation level needed for transaction T to ensure that queries Q1 and Q2 will always get the same result? Choices are: Read-Uncommitted, Read-Committed, Repeatable-Read, Serializable ",
			"points":"1"

		},

		{
			"questionType": "filesubmission",
			"questionText": " Suppose all other transactions in the system are declared as Serializable, and they only involve queries, updates, and deletions. What is the weakest isolation level needed for transaction T to ensure that queries Q1 and Q2 will always get the same result? Choices are: Read-Uncommitted, Read-Committed, Repeatable-Read, Serializable ",
			"points":"1"

		},

		{
			"questionType": "filesubmission",
			"questionText": " Suppose all other transactions in the system are declared as Serializable, and we know nothing else about them. What is the weakest isolation level needed for transaction T to ensure that queries Q1 and Q2 will always get the same result? Choices are: Read-Uncommitted, Read-Committed, Repeatable-Read, Serializable ",
			"points":"1"

		},

		{
			"questionType": "filesubmission",
			"questionText": " Now consider the following variation, where the two queries are in two different transactions: <br> <code>T1: <br>  Begin Transaction;<br>  Q1: Select Avg(age) From Person;<br>  <read-only activity><br>  Commit;<br>T2:<br>  Begin Transaction;<br>  Q2: Select Avg(age) From Person;<br>  <read-only activity><br>  Commit; </code><br>Suppose both transactions T1 and T2 execute with isolation level Serializable. Consider scenarios (a), (b), and (c) above for all other transactions in the system. For which of these scenarios, if any, are we guaranteed to always get the same result for Q1 and Q2? ",
			"points":"1"
			
		}

	]
},
{
	"title": "Assignment-4",
	"activityType": "assignment",
	"quizDescription":"Consider table Worker(name,pay) where name is a key, and the following two concurrent transactions.<code>T1:<br>  Begin Transaction<br>  S1: update Worker set pay = 2*pay where name = 'Amy'<br>  S2: update Worker set pay = 3*pay where name = 'Amy'<br>  Commit<br>T2:<br>  Begin Transaction<br>  S3: update Worker set pay = pay-20 where name = 'Amy'<br>  S4: update Worker set pay = pay-10 where name = 'Amy'<br>  Commit</code><br> Assume that the individual statements S1, S2, S3, and S4 always execute atomically. Let Amy's pay be 50 before either transaction begins execution. ",
	"questions": [{
			"questionType": "filesubmission",
			"questionText": " Suppose both transactions T1 and T2 execute to completion with isolation level Serializable. What are the possible values for Amy's final pay? ",
			"points":"1"

		},

		{
			"questionType": "filesubmission",
			"questionText": " Suppose both transactions T1 and T2 execute to completion with isolation level Read-Committed. What are the possible values for Amy's final pay? ",
			"points":"1"

		},

		{
			"questionType": "filesubmission",
			"questionText": " Suppose transaction T1 executes with isolation level Read-Committed, transaction T2 executes with isolation level Read-Uncommitted, and both transactions execute to completion. What are the possible values for Amy's final pay? ",
			"points":"1"

		},

		{
			"questionType": "filesubmission",
			"questionText": " Suppose both transactions T1 and T2 execute to completion with isolation level Read-Uncommitted. What are the possible values for Amy's final pay? ",
			"points":"1"

		},

		{
			"questionType": "filesubmission",
			"questionText": " Suppose both transactions T1 and T2 execute with isolation level Serializable. Transaction T1 executes to completion, but transaction T2 rolls back after statement S3 and does not re-execute. What are the possible values for Amy's final pay? ",
			"points":"1"
			
		}

	]
}
]